/*
 *  $Id: edftostr.c,v 1.1 1993/04/06 14:14:07 sev Exp $
 *
 * ---------------------------------------------------------- 
 *
 * $Log: edftostr.c,v $
 * Revision 1.1  1993/04/06 14:14:07  sev
 * Initial revision
 *
 * Revision 1.5  1993/04/05  16:01:33  kas
 * *** empty log message ***
 *
 * Revision 1.4  1993/04/01  14:10:29  kas
 * *** empty log message ***
 *
 * Revision 1.3  1993/03/15  13:47:31  sev
 * Полностью заменены функции работы со справочником. Теперь он текстовый
 *
 * Revision 1.2  1993/03/14  11:39:19  sev
 * Исправлена ошибка в отметке поля. Полностью работающая версия
 * В файле vcопределение DEFSEG - добавление окна сегментов
 *
 * Revision 1.1  1993/03/12  15:44:23  sev
 * Init
 *
 *
 */

static char rcsid[]="$Id: edftostr.c,v 1.1 1993/04/06 14:14:07 sev Exp $";


#include "vced.h"

/*************************************************************************/
/*  Функция читает из файла <file>.dir , формирует структуру справочника */
/*************************************************************************/

int edftostr()
{
  char tmp2[80];

  if(getselset(dir_file, "r", dirr))
  {
    sprintf(tmp2, "Справочник (%s) пуст", dir_file);
    ask_msg(tmp2,0);
    return(0);
  }

  return GOOD;
}
