/*
 *  $Id: edhelp.c,v 1.2 1993/04/20 16:04:12 sev Exp $
 *
 * ---------------------------------------------------------------------------
 *
 * $Log: edhelp.c,v $
 * Revision 1.2  1993/04/20 16:04:12  sev
 * a
 *
 * Revision 1.3  1993/04/15  15:05:51  kas
 * *** empty log message ***
 *
 * Revision 1.3  1993/04/15  15:05:51  kas
 * *** empty log message ***
 *
 * Revision 1.2  1993/04/13  13:50:41  kas
 * *** empty log message ***
 *
 * Revision 1.2  1993/04/13  13:50:41  kas
 * *** empty log message ***
 *
 * Revision 1.1  1993/04/12  15:13:06  kas
 * Initial revision
 *
 * Revision 1.1  1993/04/12  15:13:06  kas
 * Initial revision
 *
 *
 */

/* ------------------------------------------------------------------------ */

#include "vced.h"

COUNT edhelp(vced)
VCED *vced;
{
  WPTR whlp, wopen();

  whlp = wopen( 1, 0,23,78," H E L P ");
  atsay( 0,0,"Ф6  - отметка поля");
  atsay( 1,0,"Ф7  - отмена поля");
  atsay( 2,0,"Ф8  - привязка поля");
  atsay( 3,0,"Ф9  - отметка сегмента");
  atsay( 4,0,"Ф10 - справочник сегментов");
  atsay( 5,0,"Ф11 - список файлов редактора");
  atsay( 6,0,"Ф12 - ввод нового файла");
  atsay( 7,0,"Ф13 - список файлов редактора");
  atsay( 8,0,"Ф14 - следующий файл");
  atsay( 9,0,"Ф15 - удалить файл из окна");
  atsay(10,0,"Ф16 - сохранить файл");
  atsay(11,0,"Ф17 - создать файл конфигурации");
  atsay(12,0,"Ф18 - компиляция");
  atsay(13,0,"Ф19 - просмотр");
  atsay(14,0,"Ф20 - выполнить команду Unix");


  getone();
  wclose(whlp);
  return(0);
}

/* ------------------------------------------------------------------------ */
