

  1. drivesel.c    - вывод и выбор из структуры SELSET                     е
  2. edaskdir.c    - запись информации о сегменте
  3. edback.c      - создание файла-копии с расширением .b                 е
  4. edconf.c      - создание файла .cnf
  5. edconinf.c    - информация о поле
  6. eddelcon.c    - удаление отметки поля
  7. eddelendl.c   - удаление от курсора до конца строки                   е
  8. eddellin.c    - удаление строки                                       е
  9. eddir.c       - отображение списка файлов или сегментов
 10. eddisp.c      - вывод строки с отмеченными полями
 11. edend.c       - переход на конец строки/экрана/файла                  е
 12. edexec.c      - выполнение команды редактора                          е
 13. edfnd.c       - поиск команды редактора                               е
 14. edftostr.c    - чтение файла .dir (справочник сегментов)
 15. edhelp.c      - помощь
 16. edhmark.c     - отметка поля
 17. edhypend.c    - вызов компилятора и просмотрщика гипертекста
 18. edinscon.c    - вставка стоки с отмеченными полями
 19. edinsline.c   - вставка пустой строки                                 е
 20. edinsseg.c    - отметка начала и конца сегмента
 21. edit.c        - выполнение функций редактора
 22. editor.c      - головная программа
 23. edmarkpg.c    - отметка конца страницы
 24. edmesg.c      - вывод информационного сообщения
 25. edmove.c      - сдвиг влево и вправо
 26. ednumseg.c    - количество сегментов в файле
 27. edopen.c      - открытие файла  и окна для редактирования
 28. edpaste.c     - привязка поля
 29. edprtb.c      - вывод буфера редактора на экран
 30. edprtl.c      - вывод строки на экран
 31. edputch.c     - вывод символа на экран
 32. edsignal.c    - установка сигналов прерывания
 33. edstat.c      - вывод строки состояния
 34. edsys.c       - выполнение команды Unix
 35. edupda.c      - выполнить обновление
 36. edvmark.c     - отметка сегмента
 37. edwopen.c     - открытие окна редактора                               е
 38. f_to_b.c      - запись файла в буфер редактора
 39. loadfile.c    - запись буфера редактора в файл
 40. match.c       - поиск по регулярному выражению                        е
 41. system.c      - выполнить команду системы                             е
 42. wrkselset.c   - работа со структурой SELSET                           е
 43. crtlstfl.c    - построение списка файлов по регулярному выражению
 44. edsvf.c       - вспомогательные функции

 45. edextern.h    -
 46. edextfun.h    -
 47. edinitstr.h   -
 48. edkey.h       -
 49. edstruct.h    -
 50. vced.h        -
